# Pandas十分钟入门教程

这是一个简短的、针对新手的pandas使用教程。你可以在pandas使用手册（Cookbook）中查阅更复杂的用法。通常，我们以如下约定导入pandas库：

In [2]:
import pandas as pd

import numpy as np

import matplotlib.pyplot as plt

## 创建对象

通过列表创建一个序列对象（Series），Pandas会自动创建一个默认的数字索引。

In [3]:
a = pd.Series([1,3,5,np.nan, 6,8])

a

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

通过Numpy数组创建一个数据框对象（DataFrame）， 并带有日期索引和列标签。

In [4]:
dates = pd.date_range('20130101', periods=6)

print(dates)

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

                   A         B         C         D
2013-01-01 -0.797376  0.067411  2.537992  0.759009
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727
2013-01-04  1.023379 -0.815884 -0.029182  0.162669
2013-01-05 -1.173009  0.279717 -0.328597  1.892224
2013-01-06 -0.171253 -1.233790 -0.100738 -0.246908

通过字典创建数据框对象（DataFrame），字典的每个元素会被转换为一个类似序列的对象（series-like）。

In [5]:
df2 = pd.DataFrame({
    'A': 1.,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'
})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

获取数据框各列的数据类型

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

如果你使用IPython（或Jupyter Notebook），Tab键可自动补全列名（就像补全对象的公有属性一样）。如下是部分可补全的属性：

In [7]:
# df2.<TAB>

# df2.A df2.bool
# df2.abs df2.boxplot
# df2.add df2.C
# df2.add_prefix df2.clip
# df2.add_suffix df2.clip_lower
# df2.align df2.clip_upper
# df2.all df2.columns
# df2.any df2.combine
# df2.append df2.combine_first
# df2.apply df2.compound
# df2.applymap df2.consolidate
# df2.D

如你所见，列名A，B，C和D可自动补全。列名E也可自动补全；为了简洁，此处剩余的属性被删减了。

## 显示数据

查看数据框顶部和底部的记录（行）

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -0.797376  0.067411  2.537992  0.759009
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727
2013-01-04  1.023379 -0.815884 -0.029182  0.162669
2013-01-05 -1.173009  0.279717 -0.328597  1.892224

In [9]:
df.tail()

                   A         B         C         D
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727
2013-01-04  1.023379 -0.815884 -0.029182  0.162669
2013-01-05 -1.173009  0.279717 -0.328597  1.892224
2013-01-06 -0.171253 -1.233790 -0.100738 -0.246908

显示索引、列名，以及其中的numpy数据

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[-0.79737596,  0.06741054,  2.53799213,  0.75900939],
       [ 1.10055044, -0.43617994, -0.3446604 ,  0.26456561],
       [ 0.621163  , -0.11133894, -0.05282732, -0.2207271 ],
       [ 1.0233787 , -0.81588432, -0.02918216,  0.16266867],
       [-1.17300939,  0.27971694, -0.32859682,  1.89222403],
       [-0.17125339, -1.23378989, -0.10073778, -0.24690808]])

describe方法查看数据的描述性统计信息

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.100576 -0.375011  0.280331  0.435139
std    0.961744  0.570884  1.114491  0.803327
min   -1.173009 -1.233790 -0.344660 -0.246908
25%   -0.640845 -0.720958 -0.271632 -0.124878
50%    0.224955 -0.273759 -0.076783  0.213617
75%    0.922825  0.022723 -0.035093  0.635398
max    1.100550  0.279717  2.537992  1.892224

转置数据

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.797376    1.100550    0.621163    1.023379   -1.173009   -0.171253
B    0.067411   -0.436180   -0.111339   -0.815884    0.279717   -1.233790
C    2.537992   -0.344660   -0.052827   -0.029182   -0.328597   -0.100738
D    0.759009    0.264566   -0.220727    0.162669    1.892224   -0.246908

按轴排序数据

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.759009  2.537992  0.067411 -0.797376
2013-01-02  0.264566 -0.344660 -0.436180  1.100550
2013-01-03 -0.220727 -0.052827 -0.111339  0.621163
2013-01-04  0.162669 -0.029182 -0.815884  1.023379
2013-01-05  1.892224 -0.328597  0.279717 -1.173009
2013-01-06 -0.246908 -0.100738 -1.233790 -0.171253

按值排序数据

In [16]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -0.171253 -1.233790 -0.100738 -0.246908
2013-01-04  1.023379 -0.815884 -0.029182  0.162669
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727
2013-01-01 -0.797376  0.067411  2.537992  0.759009
2013-01-05 -1.173009  0.279717 -0.328597  1.892224

## 选择数据

注意：尽管标准的Python和Numpy表达式在数据选择和设置上较为直观，并且在交互式环境能派上用场，但对于开发代码，我们推荐使用经过优化的pandas获取数据的方法，如.at, .iat, .loc, .iloc和ix

### 获取数据

选择一个单独列，将会返回一个序列对象（Series）， 等价于df.A

In [17]:
df['A']

2013-01-01   -0.797376
2013-01-02    1.100550
2013-01-03    0.621163
2013-01-04    1.023379
2013-01-05   -1.173009
2013-01-06   -0.171253
Freq: D, Name: A, dtype: float64

使用[]操作符可对数据框的行进行切片操作

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.797376  0.067411  2.537992  0.759009
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727

In [19]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727
2013-01-04  1.023379 -0.815884 -0.029182  0.162669

### 通过标签选择数据

通过标签获取一个记录（行数据）

In [20]:
df.loc[dates[0]]

A   -0.797376
B    0.067411
C    2.537992
D    0.759009
Name: 2013-01-01 00:00:00, dtype: float64

在多个轴上通过标签选择数据

In [21]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.797376  0.067411
2013-01-02  1.100550 -0.436180
2013-01-03  0.621163 -0.111339
2013-01-04  1.023379 -0.815884
2013-01-05 -1.173009  0.279717
2013-01-06 -0.171253 -1.233790

使用标签进行切片， 两个端点都包含在内

In [22]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.100550 -0.436180
2013-01-03  0.621163 -0.111339
2013-01-04  1.023379 -0.815884

数据降维（返回降维的数据）

In [23]:
df.loc['20130102', ['A', 'B']]

A    1.10055
B   -0.43618
Name: 2013-01-02 00:00:00, dtype: float64

获取一个标量数据

In [24]:
# 通过行标签和列表标签获取一个标量数据
df.loc[dates[0], 'A']

-0.79737595824137197

更快地获取标量数量

In [25]:
df.at[dates[0], 'A']

-0.79737595824137197

### 通过位置选择数据

通过传入数字位置选择数据

In [26]:
df.iloc[3]

A    1.023379
B   -0.815884
C   -0.029182
D    0.162669
Name: 2013-01-04 00:00:00, dtype: float64

使用数字切片，类似Python和Numpy中的切片

In [27]:
# 注意此处的切片不包含结束位置
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.023379 -0.815884
2013-01-05 -1.173009  0.279717

使用数字列表，类似Python和Numpy的风格

In [28]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.100550 -0.344660
2013-01-03  0.621163 -0.052827
2013-01-05 -1.173009 -0.328597

只选择行数据

In [29]:
# : 表示选择所有列
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727

只选择列数据

In [30]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.067411  2.537992
2013-01-02 -0.436180 -0.344660
2013-01-03 -0.111339 -0.052827
2013-01-04 -0.815884 -0.029182
2013-01-05  0.279717 -0.328597
2013-01-06 -1.233790 -0.100738

获取一个具体的值

In [31]:
df.iloc[1, 1]

-0.43617994246400049

快速获取一个标量数据

In [32]:
df.iat[1, 1]

-0.43617994246400049

### 布尔索引

使用单独列的值选择数据

In [33]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.100550 -0.436180 -0.344660  0.264566
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727
2013-01-04  1.023379 -0.815884 -0.029182  0.162669

选择满足布尔条件的值

In [34]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.067411  2.537992  0.759009
2013-01-02  1.100550       NaN       NaN  0.264566
2013-01-03  0.621163       NaN       NaN       NaN
2013-01-04  1.023379       NaN       NaN  0.162669
2013-01-05       NaN  0.279717       NaN  1.892224
2013-01-06       NaN       NaN       NaN       NaN

使用isin()方法筛选

In [35]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df2

                   A         B         C         D      E
2013-01-01 -0.797376  0.067411  2.537992  0.759009    one
2013-01-02  1.100550 -0.436180 -0.344660  0.264566    one
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727    two
2013-01-04  1.023379 -0.815884 -0.029182  0.162669  three
2013-01-05 -1.173009  0.279717 -0.328597  1.892224   four
2013-01-06 -0.171253 -1.233790 -0.100738 -0.246908  three

In [36]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727   two
2013-01-05 -1.173009  0.279717 -0.328597  1.892224  four

### 修改数据

增加一个新列会自动通过索引对齐数据

In [37]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [38]:
df['E'] = s1

df

                   A         B         C         D    E
2013-01-01 -0.797376  0.067411  2.537992  0.759009  NaN
2013-01-02  1.100550 -0.436180 -0.344660  0.264566  1.0
2013-01-03  0.621163 -0.111339 -0.052827 -0.220727  2.0
2013-01-04  1.023379 -0.815884 -0.029182  0.162669  3.0
2013-01-05 -1.173009  0.279717 -0.328597  1.892224  4.0
2013-01-06 -0.171253 -1.233790 -0.100738 -0.246908  5.0

通过标签设置数据

In [39]:
df.at[dates[0], 'A'] = 0

通过位置设置数据

In [40]:
df.iat[0, 1] = 0

通过Numpy数组设置数据

In [41]:
df.loc[:, 'D'] = np.array([5] * len(df))

这步操作的结果为：

In [42]:
df

                   A         B         C  D    E
2013-01-01  0.000000  0.000000  2.537992  5  NaN
2013-01-02  1.100550 -0.436180 -0.344660  5  1.0
2013-01-03  0.621163 -0.111339 -0.052827  5  2.0
2013-01-04  1.023379 -0.815884 -0.029182  5  3.0
2013-01-05 -1.173009  0.279717 -0.328597  5  4.0
2013-01-06 -0.171253 -1.233790 -0.100738  5  5.0

A where operation with setting

In [43]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -2.537992 -5  NaN
2013-01-02 -1.100550 -0.436180 -0.344660 -5 -1.0
2013-01-03 -0.621163 -0.111339 -0.052827 -5 -2.0
2013-01-04 -1.023379 -0.815884 -0.029182 -5 -3.0
2013-01-05 -1.173009 -0.279717 -0.328597 -5 -4.0
2013-01-06 -0.171253 -1.233790 -0.100738 -5 -5.0

### 处理缺失数据

Pandas使用np.nan表示缺失值。缺失值默认不会参与计算。

重新索引（Reindexing）可改变、新增或删除某个轴上的索引， 并返回一个数据副本。

In [44]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1], 'E'] = 1

df1

                   A         B         C  D    E    E
2013-01-01  0.000000  0.000000  2.537992  5  1.0  1.0
2013-01-02  1.100550 -0.436180 -0.344660  5  1.0  1.0
2013-01-03  0.621163 -0.111339 -0.052827  5  2.0  2.0
2013-01-04  1.023379 -0.815884 -0.029182  5  3.0  3.0

删除所有含有缺失值的行

In [45]:
df1.dropna(how='any')

                   A         B         C  D    E    E
2013-01-01  0.000000  0.000000  2.537992  5  1.0  1.0
2013-01-02  1.100550 -0.436180 -0.344660  5  1.0  1.0
2013-01-03  0.621163 -0.111339 -0.052827  5  2.0  2.0
2013-01-04  1.023379 -0.815884 -0.029182  5  3.0  3.0

填充缺失值

In [46]:
df1.fillna(value=5)

                   A         B         C  D    E    E
2013-01-01  0.000000  0.000000  2.537992  5  1.0  1.0
2013-01-02  1.100550 -0.436180 -0.344660  5  1.0  1.0
2013-01-03  0.621163 -0.111339 -0.052827  5  2.0  2.0
2013-01-04  1.023379 -0.815884 -0.029182  5  3.0  3.0

获取缺失值处的布尔掩码

In [47]:
# 文档中使用的是isna()方法，最新文档为0.21.0
# 我使用的pandas版本为0.20.3
pd.isnull(df1)

                A      B      C      D      E      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

## 操作

### 统计操作

操作不包括缺失数据。

描述性统计，获取均值

In [49]:
# 默认在轴0上执行操作
df.mean()

A    0.233472
B   -0.386246
C    0.280331
D    5.000000
E    3.000000
dtype: float64

在另一轴上执行相同操作

In [50]:
df.mean(1)

2013-01-01    1.884498
2013-01-02    1.263942
2013-01-03    1.491399
2013-01-04    1.635662
2013-01-05    1.555622
2013-01-06    1.698844
Freq: D, dtype: float64

操作具有不同维度和需要对齐的数据对象，Pandas会自动沿指定维度进行广播。

In [52]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [58]:
df.sub(s, axis='index')

                   A         B         C    D    E
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.378837 -1.111339 -1.052827  4.0  1.0
2013-01-04 -1.976621 -3.815884 -3.029182  2.0  0.0
2013-01-05 -6.173009 -4.720283 -5.328597  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### 批处理Apply

使用apple()方法向数据应用方法

In [59]:
df.apply(np.cumsum)

                   A         B         C   D     E
2013-01-01  0.000000  0.000000  2.537992   5   NaN
2013-01-02  1.100550 -0.436180  2.193332  10   1.0
2013-01-03  1.721713 -0.547519  2.140504  15   3.0
2013-01-04  2.745092 -1.363403  2.111322  20   6.0
2013-01-05  1.572083 -1.083686  1.782725  25  10.0
2013-01-06  1.400829 -2.317476  1.681988  30  15.0

In [60]:
df.apply(lambda x: x.max() - x.min())

A    2.273560
B    1.513507
C    2.882653
D    0.000000
E    4.000000
dtype: float64

### 频率统计

In [61]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    1
1    4
2    0
3    1
4    6
5    6
6    3
7    1
8    0
9    3
dtype: int32

In [62]:
s.value_counts()

1    3
6    2
3    2
0    2
4    1
dtype: int64

### 字符串方法

序列对象（Series）具备一套字符串处理方法，通过str属性可访问，该方法可作用在序列对象的每一个元素上，如下所示。注意：字符串中的模式匹配默认使用正则表达式。

In [68]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object